Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/rot.h
/* -------- ROT_PATCH_CODE : (ROT Offset: 0x80) (R/W 32) Patch Code -------- */
#define ROT_PATCH_CODE_RESETVALUE             _UINT32_(0x00)                                       /*  (ROT_PATCH_CODE) Patch Code  Reset Value */

#define ROT_PATCH_CODE_PATCH_CODE_Pos         _UINT32_(0)                                          /* (ROT_PATCH_CODE) Patch Code bits Position */
#define ROT_PATCH_CODE_PATCH_CODE_Msk         (_UINT32_(0xFFFFFFFF) << ROT_PATCH_CODE_PATCH_CODE_Pos) /* (ROT_PATCH_CODE) Patch Code bits Mask */
#define ROT_PATCH_CODE_PATCH_CODE(value)      (ROT_PATCH_CODE_PATCH_CODE_Msk & (_UINT32_(value) << ROT_PATCH_CODE_PATCH_CODE_Pos)) /* Assigment of value for PATCH_CODE in the ROT_PATCH_CODE register */
#define ROT_PATCH_CODE_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ROT_PATCH_CODE) Register Mask  */


/* -------- ROT_UUID : (ROT Offset: 0x170) (R/W 32) Unique ID -------- */
#define ROT_UUID_RESETVALUE                   _UINT32_(0x00)                                       /*  (ROT_UUID) Unique ID  Reset Value */

#define ROT_UUID_UUID_Pos                     _UINT32_(0)                                          /* (ROT_UUID) Unique ID bits Position */
#define ROT_UUID_UUID_Msk                     (_UINT32_(0xFFFFFFFF) << ROT_UUID_UUID_Pos)          /* (ROT_UUID) Unique ID bits Mask */
#define ROT_UUID_UUID(value)                  (ROT_UUID_UUID_Msk & (_UINT32_(value) << ROT_UUID_UUID_Pos)) /* Assigment of value for UUID in the ROT_UUID register */
#define ROT_UUID_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ROT_UUID) Register Mask  */


/* -------- ROT_SEC_BOOT : (ROT Offset: 0xC00) (R/W 32) Secure Boot Register -------- */
#define ROT_SEC_BOOT_RESETVALUE               _UINT32_(0x10002)                                    /*  (ROT_SEC_BOOT) Secure Boot Register  Reset Value */

#define ROT_SEC_BOOT_SEC_BOOT_REQD_Pos        _UINT32_(0)                                          /* (ROT_SEC_BOOT) Bits to indicate that secure boot is required on the next device reset. Position */
#define ROT_SEC_BOOT_SEC_BOOT_REQD_Msk        (_UINT32_(0x3) << ROT_SEC_BOOT_SEC_BOOT_REQD_Pos)    /* (ROT_SEC_BOOT) Bits to indicate that secure boot is required on the next device reset. Mask */
#define ROT_SEC_BOOT_SEC_BOOT_REQD(value)     (ROT_SEC_BOOT_SEC_BOOT_REQD_Msk & (_UINT32_(value) << ROT_SEC_BOOT_SEC_BOOT_REQD_Pos)) /* Assigment of value for SEC_BOOT_REQD in the ROT_SEC_BOOT register */
#define   ROT_SEC_BOOT_SEC_BOOT_REQD_0_Val    _UINT32_(0x0)                                        /* (ROT_SEC_BOOT) S ecure boot code authentication is required  */
#define   ROT_SEC_BOOT_SEC_BOOT_REQD_1_Val    _UINT32_(0x1)                                        /* (ROT_SEC_BOOT) S ecure boot code authentication is NOT required  */
#define   ROT_SEC_BOOT_SEC_BOOT_REQD_2_Val    _UINT32_(0x2)                                        /* (ROT_SEC_BOOT) S ecure boot code authentication is NOT required  */
#define   ROT_SEC_BOOT_SEC_BOOT_REQD_3_Val    _UINT32_(0x3)                                        /* (ROT_SEC_BOOT) S ecure boot code authentication is required  */
#define ROT_SEC_BOOT_SEC_BOOT_REQD_0          (ROT_SEC_BOOT_SEC_BOOT_REQD_0_Val << ROT_SEC_BOOT_SEC_BOOT_REQD_Pos) /* (ROT_SEC_BOOT) S ecure boot code authentication is required Position  */
#define ROT_SEC_BOOT_SEC_BOOT_REQD_1          (ROT_SEC_BOOT_SEC_BOOT_REQD_1_Val << ROT_SEC_BOOT_SEC_BOOT_REQD_Pos) /* (ROT_SEC_BOOT) S ecure boot code authentication is NOT required Position  */
#define ROT_SEC_BOOT_SEC_BOOT_REQD_2          (ROT_SEC_BOOT_SEC_BOOT_REQD_2_Val << ROT_SEC_BOOT_SEC_BOOT_REQD_Pos) /* (ROT_SEC_BOOT) S ecure boot code authentication is NOT required Position  */
#define ROT_SEC_BOOT_SEC_BOOT_REQD_3          (ROT_SEC_BOOT_SEC_BOOT_REQD_3_Val << ROT_SEC_BOOT_SEC_BOOT_REQD_Pos) /* (ROT_SEC_BOOT) S ecure boot code authentication is required Position  */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos  _UINT32_(4)                                          /* (ROT_SEC_BOOT) Bits to indicate whether the Flash contents have been changed since the last code authentication operation Position */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Msk  (_UINT32_(0x3) << ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos) /* (ROT_SEC_BOOT) Bits to indicate whether the Flash contents have been changed since the last code authentication operation Mask */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY(value) (ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Msk & (_UINT32_(value) << ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos)) /* Assigment of value for SEC_FLASH_NOT_DIRTY in the ROT_SEC_BOOT register */
#define   ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_0_Val _UINT32_(0x0)                                        /* (ROT_SEC_BOOT) Flash contents have changed since the last authentication  */
#define   ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_1_Val _UINT32_(0x1)                                        /* (ROT_SEC_BOOT) Flash contents have changed since the last authentication  */
#define   ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_2_Val _UINT32_(0x2)                                        /* (ROT_SEC_BOOT) Flash contents have changed since the last authentication  */
#define   ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_3_Val _UINT32_(0x3)                                        /* (ROT_SEC_BOOT) Flash contents have not changed since the last authentication  */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_0    (ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_0_Val << ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos) /* (ROT_SEC_BOOT) Flash contents have changed since the last authentication Position  */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_1    (ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_1_Val << ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos) /* (ROT_SEC_BOOT) Flash contents have changed since the last authentication Position  */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_2    (ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_2_Val << ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos) /* (ROT_SEC_BOOT) Flash contents have changed since the last authentication Position  */
#define ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_3    (ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_3_Val << ROT_SEC_BOOT_SEC_FLASH_NOT_DIRTY_Pos) /* (ROT_SEC_BOOT) Flash contents have not changed since the last authentication Position  */
#define ROT_SEC_BOOT_SEC_BOOT_STATUS_Pos      _UINT32_(8)                                          /* (ROT_SEC_BOOT) Bits to indicate that secure boot status Position */
#define ROT_SEC_BOOT_SEC_BOOT_STATUS_Msk      (_UINT32_(0xFF) << ROT_SEC_BOOT_SEC_BOOT_STATUS_Pos) /* (ROT_SEC_BOOT) Bits to indicate that secure boot status Mask */
#define ROT_SEC_BOOT_SEC_BOOT_STATUS(value)   (ROT_SEC_BOOT_SEC_BOOT_STATUS_Msk & (_UINT32_(value) << ROT_SEC_BOOT_SEC_BOOT_STATUS_Pos)) /* Assigment of value for SEC_BOOT_STATUS in the ROT_SEC_BOOT register */
#define ROT_SEC_BOOT_SEC_BOOT_DONE_Pos        _UINT32_(16)                                         /* (ROT_SEC_BOOT) Bits to indicate that secure boot is done Position */
#define ROT_SEC_BOOT_SEC_BOOT_DONE_Msk        (_UINT32_(0x3) << ROT_SEC_BOOT_SEC_BOOT_DONE_Pos)    /* (ROT_SEC_BOOT) Bits to indicate that secure boot is done Mask */
#define ROT_SEC_BOOT_SEC_BOOT_DONE(value)     (ROT_SEC_BOOT_SEC_BOOT_DONE_Msk & (_UINT32_(value) << ROT_SEC_BOOT_SEC_BOOT_DONE_Pos)) /* Assigment of value for SEC_BOOT_DONE in the ROT_SEC_BOOT register */
#define   ROT_SEC_BOOT_SEC_BOOT_DONE_0_Val    _UINT32_(0x0)                                        /* (ROT_SEC_BOOT) S ecure boot is done  */
#define   ROT_SEC_BOOT_SEC_BOOT_DONE_1_Val    _UINT32_(0x1)                                        /* (ROT_SEC_BOOT) S ecure boot is not done  */
#define   ROT_SEC_BOOT_SEC_BOOT_DONE_2_Val    _UINT32_(0x2)                                        /* (ROT_SEC_BOOT) S ecure boot is not done  */
#define   ROT_SEC_BOOT_SEC_BOOT_DONE_3_Val    _UINT32_(0x3)                                        /* (ROT_SEC_BOOT) S ecure boot is done  */
#define ROT_SEC_BOOT_SEC_BOOT_DONE_0          (ROT_SEC_BOOT_SEC_BOOT_DONE_0_Val << ROT_SEC_BOOT_SEC_BOOT_DONE_Pos) /* (ROT_SEC_BOOT) S ecure boot is done Position  */
#define ROT_SEC_BOOT_SEC_BOOT_DONE_1          (ROT_SEC_BOOT_SEC_BOOT_DONE_1_Val << ROT_SEC_BOOT_SEC_BOOT_DONE_Pos) /* (ROT_SEC_BOOT) S ecure boot is not done Position  */
#define ROT_SEC_BOOT_SEC_BOOT_DONE_2          (ROT_SEC_BOOT_SEC_BOOT_DONE_2_Val << ROT_SEC_BOOT_SEC_BOOT_DONE_Pos) /* (ROT_SEC_BOOT) S ecure boot is not done Position  */
#define ROT_SEC_BOOT_SEC_BOOT_DONE_3          (ROT_SEC_BOOT_SEC_BOOT_DONE_3_Val << ROT_SEC_BOOT_SEC_BOOT_DONE_Pos) /* (ROT_SEC_BOOT) S ecure boot is done Position  */
#define ROT_SEC_BOOT_Msk                      _UINT32_(0x0003FF33)                                 /* (ROT_SEC_BOOT) Register Mask  */


/* -------- ROT_EFUSE_RWDATA : (ROT Offset: 0xC04) (R/W 32) EFuse RW Data Register -------- */
#define ROT_EFUSE_RWDATA_RESETVALUE           _UINT32_(0x00)                                       /*  (ROT_EFUSE_RWDATA) EFuse RW Data Register  Reset Value */

